export const COURSE_SCHEDULE = [
  {
    "week": 1,
    "date": "20 ตุลาคม 2569",
    "title": "หน่วยที่ 1 การจัดเก็บข้อมูลในระบบคอมพิวเตอร์และปัญหาการจัดเก็บข้อมูลในระบบไฟล์ข้อมูล"
  },
  {
    "week": 2,
    "date": "27 ตุลาคม 2569",
    "title": "หน่วยที่ 2 การจัดเก็บข้อมูลในระบบฐานข้อมูล ประโยชน์ ชนิด และคำศัพท์เกี่ยวกับฐานข้อมูลเชิงสัมพันธ์"
  },
  {
    "week": 3,
    "date": "3 พฤศจิกายน 2569",
    "title": "หน่วยที่ 3 ปัญหาการสร้างฐานข้อมูลโดยไม่ออกแบบและการออกแบบด้วย ERD"
  },
  {
    "week": 4,
    "date": "10 พฤศจิกายน 2569",
    "title": "หน่วยที่ 4 ขั้นตอนการพัฒนางานฐานข้อมูล ซอฟต์แวร์ DBMS และการติดตั้ง MySQL Workbench"
  },
  {
    "week": 5,
    "date": "17 พฤศจิกายน 2569",
    "title": "หน่วยที่ 5 การสร้างฐานข้อมูลและตารางด้วยคำสั่ง SQL"
  },
  {
    "week": 6,
    "date": "24 พฤศจิกายน 2569",
    "title": "หน่วยที่ 6 ชนิดข้อมูล  การกำหนดคีย์หลัก และคีย์นอก"
  },
  {
    "week": 7,
    "date": "1 ธันวาคม 2569",
    "title": "หน่วยที่ 7 การเพิ่ม ลบ และแก้ไขข้อมูลในตารางด้วยคำสั่ง SQL"
  },
  {
    "week": 8,
    "date": "8 ธันวาคม 2569",
    "title": "หน่วยที่ 8 การสร้างความสัมพันธ์ระหว่างตาราง"
  },
  {
    "week": 9,
    "date": "15 ธันวาคม 2569",
    "title": "สอบกลางภาค"
  },
  {
    "week": 10,
    "date": "22 ธันวาคม 2569",
    "title": "หน่วยที่ 9 การสืบค้นข้อมูลพื้นฐานด้วยคำสั่ง SQL SELECT และเงื่อนไข WHERE"
  },
  {
    "week": 11,
    "date": "5 มกราคม 2570",
    "title": "หน่วยที่ 10 การใช้ฟังก์ชันคำนวณและจัดกลุ่มข้อมูล"
  },
  {
    "week": 12,
    "date": "12 มกราคม 2570",
    "title": "หน่วยที่ 11 การสืบค้นข้อมูลขั้นสูงด้วย Multiple Tables Joins"
  },
  {
    "week": 13,
    "date": "19 มกราคม 2570",
    "title": "หน่วยที่ 12 การใช้งาน Subquery และ Nested Queries"
  },
  {
    "week": 14,
    "date": "26 มกราคม 2570",
    "title": "หน่วยที่ 13 การสร้างมุมมอง และดัชนี  เพื่อเพิ่มประสิทธิภาพฐานข้อมูล"
  },
  {
    "week": 15,
    "date": "2 กุมภาพันธ์ 2570",
    "title": "หน่วยที่ 14 การสร้างและจัดการ Stored Procedures และ Triggers"
  },
  {
    "week": 16,
    "date": "9 กุมภาพันธ์ 2570",
    "title": "หน่วยที่ 15 การจัดการผู้ใช้งานระบบ และความปลอดภัยของฐานข้อมูล"
  },
  {
    "week": 17,
    "date": "16 กุมภาพันธ์ 2570",
    "title": "หน่วยที่ 16 การพัฒนางานฐานข้อมูลฉบับสมบูรณ์และการจัดทำแฟ้มสะสมผลงาน"
  },
  {
    "week": 18,
    "date": "23 กุมภาพันธ์ 2570",
    "title": "สอบปลายภาค"
  }
];
